## 퀴즈 10

In [1]:
import pandas as pd
import numpy as np

In [2]:
# 1번
profit1 = {'매출' : [1000, 1500, 3000, 4000, 5000, 6000],
'비용' : [1500, 2000, 2500, 2700, 3000, 3200]}
columns1 = ['매출', '비용']
index1 = ['1월', '2월', '3월', '4월', '5월', '6월']
df1 = pd.DataFrame(profit1, index=index1, columns=columns1)
df1['이익'] = df1['매출'] - df1['비용']
print(df1)
profit2 = {'매출' : [4500, 4000, 5000, 6000, 3000, 2000],
'비용' : [2800, 2700, 3000, 3200, 2500, 2000]}
columns2 = ['매출', '비용']
index2 = ['7월', '8월', '9월', '10월', '11월', '12월']
df2 = pd.DataFrame(profit2, index=index2, columns=columns2)
df2['이익'] = df2['매출'] - df2['비용']
print(df2)

      매출    비용    이익
1월  1000  1500  -500
2월  1500  2000  -500
3월  3000  2500   500
4월  4000  2700  1300
5월  5000  3000  2000
6월  6000  3200  2800
       매출    비용    이익
7월   4500  2800  1700
8월   4000  2700  1300
9월   5000  3000  2000
10월  6000  3200  2800
11월  3000  2500   500
12월  2000  2000     0

In [3]:
df3 = pd.concat([df1,df2])
df3

       매출    비용    이익
1월   1000  1500  -500
2월   1500  2000  -500
3월   3000  2500   500
4월   4000  2700  1300
5월   5000  3000  2000
6월   6000  3200  2800
7월   4500  2800  1700
8월   4000  2700  1300
9월   5000  3000  2000
10월  6000  3200  2800
11월  3000  2500   500
12월  2000  2000     0

In [4]:
# 2번
df3_1=pd.DataFrame({'매출' : [df3.sum(axis=0)[0]], 
                    '비용': [df3.sum(axis=0)[1]],
                    '이익' : [df3.sum(axis=0)[2]]},
                   index = ['총실적'])
df3_1

        매출     비용     이익
총실적  45000  31100  13900

In [5]:
pd.concat([df3,df3_1])

        매출     비용     이익
1월    1000   1500   -500
2월    1500   2000   -500
3월    3000   2500    500
4월    4000   2700   1300
5월    5000   3000   2000
6월    6000   3200   2800
7월    4500   2800   1700
8월    4000   2700   1300
9월    5000   3000   2000
10월   6000   3200   2800
11월   3000   2500    500
12월   2000   2000      0
총실적  45000  31100  13900

In [6]:
# 3번
df = pd.DataFrame({'A':[10,14,18],'B':[11,15,19],
                   'C':[12,16,20],'D':[13,17,21]}, 
                  index = ['a','b','c'])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [7]:
# 4번
df.loc[['b','c']]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [8]:
# 5번
df.loc["b":, "A"]

b    14
c    18
Name: A, dtype: int64

In [9]:
# 6번
df.loc[df.A > 10, :]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [10]:
# 7번
df = pd.DataFrame({'A':[10,14,18,90],'B':[11,15,19,91],
                   'C':[12,16,20,92],'D':[13,17,21,93]}, 
                  index = ['a','b','c','e'])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
e  90  91  92  93

In [11]:
df.iloc[0,-2:]

C    12
D    13
Name: a, dtype: int64

In [12]:
# 8번
series = pd.Series(np.arange(0,10))
series[0] = np.NaN
series[2] = np.NaN
series

0    NaN
1    1.0
2    NaN
3    3.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [13]:
# 9번
df = pd.DataFrame({0:[0.0,3.0,3.0,4.0],1:[0.0,0.0,2.0,3.0],2:[3.0,2.0,1.0,4.0],3:[2.0,1.0,5,2.0]})
df.iloc[2,3] = np.NaN
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  1.0  NaN
3  4.0  3.0  4.0  2.0

In [14]:
df.sort_values(2)

     0    1    2    3
2  3.0  2.0  1.0  NaN
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
3  4.0  3.0  4.0  2.0

In [15]:
# 10번
df.iloc[2,3] = df[3].mean()
df

     0    1    2         3
0  0.0  0.0  3.0  2.000000
1  3.0  0.0  2.0  1.000000
2  3.0  2.0  1.0  1.666667
3  4.0  3.0  4.0  2.000000

# pandas_indexing.pdf
# 데이터프레임 인덱서

## loc 인덱서

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.arange(10,22).reshape(3,4),
                  index=['a','b','c'],
                  columns =['A','B','C','D'])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [2]:
df.loc['a','A'] # 행,열

10

In [3]:
df.loc['b':,'A']

b    14
c    18
Name: A, dtype: int32

In [4]:
df.loc['a',:]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [5]:
df.loc[['a','b'],['B','D']]

    B   D
a  11  13
b  15  17

In [6]:
df.loc[df.A>10,:]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [7]:
df.loc['a',:]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [8]:
df[:1]

    A   B   C   D
a  10  11  12  13

In [9]:
df['a':]

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [10]:
def select_rows(df):
    return df.A > 12
select_rows(df)

a    False
b     True
c     True
Name: A, dtype: bool

In [11]:
df.loc[select_rows(df),['B']]

    B
b  15
c  19

In [12]:
# df.loc[:,df[:1] <=11] # loc 인덱서에는 이렇게 넣을 수 없음
df.loc[:,df.loc['a',:] <=11]

    A   B
a  10  11
b  14  15
c  18  19

In [13]:
df.loc['a']

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [14]:
df.loc['e']=[90,91,92,93]
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
e  90  91  92  93

In [15]:
df2 = pd.DataFrame(np.arange(10,26).reshape(4,4),columns=np.arange(1,8,2))
df2

    1   3   5   7
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [16]:
df2.loc[1,1]

14

In [17]:
df2.loc[[1,2]]

    1   3   5   7
1  14  15  16  17
2  18  19  20  21

In [18]:
df2.loc[1:2,:]

    1   3   5   7
1  14  15  16  17
2  18  19  20  21

## iloc 인덱서

In [19]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
e  90  91  92  93

In [20]:
df.iloc[0,1]

11

In [21]:
df.iloc[:2,2]

a    12
b    16
Name: C, dtype: int64

In [22]:
df.iloc[0,-2:]

C    12
D    13
Name: a, dtype: int64

In [23]:
df.iloc[2:3,1:3]

    B   C
c  19  20

In [24]:
df.iloc[-1] #마지막 행을 출력

A    90
B    91
C    92
D    93
Name: e, dtype: int64

In [25]:
df.iloc[-1] = df.iloc[-1]*2 #브로드캐스팅

In [26]:
df

     A    B    C    D
a   10   11   12   13
b   14   15   16   17
c   18   19   20   21
e  180  182  184  186

## 데이터프레임의 데이터 조작

## 데이터 갯수 세기

In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [3]:
s.count() # NaN을 제외한 개수를 셈

9

In [4]:
np.random.seed(2)
df= pd.DataFrame(np.random.randint(5,size = (4,4)),dtype =float)
df.iloc[2,3] =np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [5]:
df.count() # 행방향, 열의 원소개수를 셈

0    4
1    4
2    4
3    3
dtype: int64

## 카테고리 값 세기

In [6]:
np.random.seed(1);
s2= pd.Series(np.random.randint(6,size=10)) # randint(6,size=10) 0~5까지 정수
s2

0    5
1    3
2    4
3    0
4    1
5    3
6    5
7    0
8    0
9    1
dtype: int32

In [7]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6,size = 100))
s2.tail()

95    4
96    5
97    2
98    4
99    3
dtype: int32

In [8]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [10]:
df[0].value_counts() # df 1열에서 중복된 것 count

3.0    2
0.0    1
4.0    1
Name: 0, dtype: int64

## 정렬

In [11]:
s2.value_counts().sort_index()

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

In [12]:
s.sort_values() #NaN이 있는 인덱스는 맨 뒤로. default ascending=True

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [13]:
s.sort_values(ascending=False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

In [14]:
s.sort_values(ascending=True)

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [ ]:
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [15]:
df.sort_values(by=2) #column 2를 기준으로

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [18]:
df.sort_values(by=[1,2])

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

## 행/열 합계

In [19]:
np.random.seed(1)
df2= pd.DataFrame(np.random.randint(10,size=(4,8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [20]:
df2.sum(axis = 1)

0    35
1    34
2    41
3    42
dtype: int64

In [21]:
df2['RowSum'] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

In [25]:
df2.sum() # 열합계(axis=0)

0          24
1          33
2          25
3          24
4          15
5          10
6           5
7          16
RowSum    152
dtype: int64

In [27]:
df2.sum(axis=1) #행합계

0    70
1    68
2    82
3    84
dtype: int64

In [28]:
df2.sum(axis=0) #열합계

0          24
1          33
2          25
3          24
4          15
5          10
6           5
7          16
RowSum    152
dtype: int64

In [29]:
df2.loc['ColTotal',:] = df2.sum()
df2

             0     1     2     3     4     5    6     7  RowSum
0          5.0   8.0   9.0   5.0   0.0   0.0  1.0   7.0    35.0
1          6.0   9.0   2.0   4.0   5.0   2.0  4.0   2.0    34.0
2          4.0   7.0   7.0   9.0   1.0   7.0  0.0   6.0    41.0
3          9.0   9.0   7.0   6.0   9.0   1.0  0.0   1.0    42.0
ColTotal  24.0  33.0  25.0  24.0  15.0  10.0  5.0  16.0   152.0

## apply 변환

In [30]:
df3 = pd.DataFrame({
    'A':[1,3,4,3,4],
    'B':[2,3,1,2,3],
    'C':[1,5,2,4,4]})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [31]:
df3.apply(lambda x:x.max()-x.min())

A    3
B    2
C    4
dtype: int64

In [32]:
df3.apply(lambda x:x.max() - x.min(),axis= 1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

## 카테고리 값으로 변환
- cut : 실수 값의 경계선을 지정하는 경우
- qcut : 갯수가 똑같은 구간으로 나누는 경우

In [1]:
import numpy as np
import pandas as pd

In [2]:
ages = [0,2,10,21,23,37,31,61,20,41,32,100]

In [3]:
bins = [1,15, 25, 35, 60, 99]
labels = ['미성년자','청년','중년','장년','노년']
cats = pd.cut(ages, bins, labels =labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '노년', '청년', '장년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [4]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [5]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [6]:
cats.codes

array([-1,  0,  0,  1,  1,  3,  2,  4,  1,  3,  2, -1], dtype=int8)

In [8]:
df4 = pd.DataFrame(ages,columns=['ages'])
df4['age_cat'] = pd.cut(df4.ages,bins,labels=labels)
df4

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      장년
6     31      중년
7     61      노년
8     20      청년
9     41      장년
10    32      중년
11   100     NaN

In [9]:
data = np.random.randn(1000)
cats= pd.qcut(data,4,labels=['Q1','Q2','Q3','Q4'])
cats

['Q3', 'Q2', 'Q3', 'Q1', 'Q3', ..., 'Q1', 'Q4', 'Q3', 'Q4', 'Q3']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [11]:
pd.value_counts(cats)

Q1    250
Q2    250
Q3    250
Q4    250
dtype: int64

## 데이터프레임 인덱스 조작
- set_index : 기존의 행 인덱스를 제거하고 데이터 열 중 하나를 인덱스로 설정
- reset_index : 기존의 행 인덱스를 제거하고 인덱스를 마지막 데이터 열로 추가

In [12]:
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list("ABCDE"),
                              np.round(np.random.rand(3,5),2)]).T,
                              columns = ['C1','C2','C3','C4'])
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [13]:
df2 = df1.set_index('C1')
df2

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [14]:
df2.set_index('C2')

        C3    C4
C2
0.55  0.65  0.79
0.72  0.44  0.53
0.6   0.89  0.57
0.54  0.96  0.93
0.42  0.38  0.07

In [15]:
df2.reset_index()

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [16]:
df2.reset_index(drop=True) # drop=True, 기존의 index 셋팅에 사용한 열(C1)으로

     C2    C3    C4
0  0.55  0.65  0.79
1  0.72  0.44  0.53
2   0.6  0.89  0.57
3  0.54  0.96  0.93
4  0.42  0.38  0.07

## 다중 인덱스

In [18]:
np.random.seed(0)
df3 = pd.DataFrame(np.round(np.random.randn(5,4),2),
                   columns=[['A','A','B','B'],
                            ['C1','C2','C1','C2']])
df3

      A           B
     C1    C2    C1    C2
0  1.76  0.40  0.98  2.24
1  1.87 -0.98  0.95 -0.15
2 -0.10  0.41  0.14  1.45
3  0.76  0.12  0.44  0.33
4  1.49 -0.21  0.31 -0.85

In [19]:
df3.columns.names= ['Cidx1','Cidx2']
df3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      1.76  0.40  0.98  2.24
1      1.87 -0.98  0.95 -0.15
2     -0.10  0.41  0.14  1.45
3      0.76  0.12  0.44  0.33
4      1.49 -0.21  0.31 -0.85

In [20]:
np.random.seed(0)
df4 = pd.DataFrame(np.round(np.random.randn(6,4),2),
                   columns=[['A','A','B','B'],
                            ['C','D','C','D']],
                   index=[['M','M','M','F','F','F'],
                          ['id_'+str(i+1) for i in range(3)]*2])
df4.columns.names = ['Cidx1','Cidx2']
df4.index.names= ['Ridx1','Ridx2']
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

## 행과 열 인덱스 교환
- stack()
- 열 인덱스 -> 행 인덱스로 변환
- unstack()
- 행 인덱스 -> 열 인덱스로 변환

In [21]:
df4.stack('Cidx1')

Cidx2                 C     D
Ridx1 Ridx2 Cidx1
M     id_1  A      1.76  0.40
            B      0.98  2.24
      id_2  A      1.87 -0.98
            B      0.95 -0.15
      id_3  A     -0.10  0.41
            B      0.14  1.45
F     id_1  A      0.76  0.12
            B      0.44  0.33
      id_2  A      1.49 -0.21
            B      0.31 -0.85
      id_3  A     -2.55  0.65
            B      0.86 -0.74

In [22]:
df4.stack(1) #Cidx2 관점의 stack

Cidx1                 A     B
Ridx1 Ridx2 Cidx2
M     id_1  C      1.76  0.98
            D      0.40  2.24
      id_2  C      1.87  0.95
            D     -0.98 -0.15
      id_3  C     -0.10  0.14
            D      0.41  1.45
F     id_1  C      0.76  0.44
            D      0.12  0.33
      id_2  C      1.49  0.31
            D     -0.21 -0.85
      id_3  C     -2.55  0.86
            D      0.65 -0.74

In [23]:
df4.unstack('Ridx2') # Ridx2 관점으로 wide하게

Cidx1     A                                   B
Cidx2     C                 D                 C                 D
Ridx2  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3
Ridx1
F      0.76  1.49 -2.55  0.12 -0.21  0.65  0.44  0.31  0.86  0.33 -0.85 -0.74
M      1.76  1.87 -0.10  0.40 -0.98  0.41  0.98  0.95  0.14  2.24 -0.15  1.45

In [25]:
df4.unstack(0) # Ridx1 관점으로 wide하게

Cidx1     A                       B
Cidx2     C           D           C           D
Ridx1     F     M     F     M     F     M     F     M
Ridx2
id_1   0.76  1.76  0.12  0.40  0.44  0.98  0.33  2.24
id_2   1.49  1.87 -0.21 -0.98  0.31  0.95 -0.85 -0.15
id_3  -2.55 -0.10  0.65  0.41  0.86  0.14 -0.74  1.45

## 다중 인덱스 기반의 인덱싱

In [26]:
df3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      1.76  0.40  0.98  2.24
1      1.87 -0.98  0.95 -0.15
2     -0.10  0.41  0.14  1.45
3      0.76  0.12  0.44  0.33
4      1.49 -0.21  0.31 -0.85

In [27]:
df3[('B','C1')]

0    0.98
1    0.95
2    0.14
3    0.44
4    0.31
Name: (B, C1), dtype: float64

In [28]:
df3.loc[0,('B','C1')]

0.98

In [29]:
df3.loc[0,('B','C1')] = 100
df3

Cidx1     A             B
Cidx2    C1    C2      C1    C2
0      1.76  0.40  100.00  2.24
1      1.87 -0.98    0.95 -0.15
2     -0.10  0.41    0.14  1.45
3      0.76  0.12    0.44  0.33
4      1.49 -0.21    0.31 -0.85

In [30]:
df3.iloc[0,2] # 다중 인덱스 사용 불가

100.0

In [31]:
df3['A']

Cidx2    C1    C2
0      1.76  0.40
1      1.87 -0.98
2     -0.10  0.41
3      0.76  0.12
4      1.49 -0.21

In [32]:
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

In [33]:
df4.loc[('M','id_1'),('A','C')]

1.76

In [34]:
df4.loc[:,('A','C')]

Ridx1  Ridx2
M      id_1     1.76
       id_2     1.87
       id_3    -0.10
F      id_1     0.76
       id_2     1.49
       id_3    -2.55
Name: (A, C), dtype: float64

In [35]:
df4.loc[("M",'id_1'),:]

Cidx1  Cidx2
A      C        1.76
       D        0.40
B      C        0.98
       D        2.24
Name: (M, id_1), dtype: float64

In [36]:
df4.loc[('All','All'),:] = df4.sum()
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74
All   All    3.23  0.39  3.68  2.28

## 데이터 프레임 병함
- merge : 두 데이터 프레임의 공통 열 혹은 인덱스를 기준으로 병합
##### # how : join 방법 (default 는 inner join),
- Outer Join = 'outer', Inner Join = 'inner', Left Join = 'left', Right Join = 'right'
##### # on : join 할 key(같은 key 값을 갖을 경우)
- join 할 키가 다수인 경우 리스트 형식으로 전달

##### # left_on, right_on : 각 join 할 key (서로 다른 key 값을 가질 때)
##### # left_index, right_index : join할 key가 인덱스일 경우
##### # sort : 조인 키 정렬

In [1]:
import pandas as pd
import numpy as np

In [2]:
df1= pd.DataFrame({
    '고객번호': [1001,1002,1003,1004,1005,1006,1007],
    '이름' : ['둘리','도우너','또치','길동','희동','마이콜','영희']},
    columns = ['고객번호','이름'])
df1

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [3]:
df2 = pd.DataFrame({'고객번호' : [1001,1001,1005,1006,1008,1001],
                    '금액' : [10000,20000,15000,5000,100000,30000]},
                   columns=['고객번호','금액'])
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [4]:
pd.merge(df1,df2) #merge 교집합

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

In [5]:
pd.merge(df1,df2, how='outer') #outer 합집합

   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0

In [6]:
pd.merge(df1,df2,how='left')

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [7]:
pd.merge(df1,df2,how='right')

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1005   희동   15000
3  1006  마이콜    5000
4  1008  NaN  100000
5  1001   둘리   30000

In [9]:
df1 = pd.DataFrame({'품종' : ['setosa','setosa','virginica','virginica'],
                    '꽃잎길이':[1.4,1.3,1.5,1.3]},
                   columns = ['품종', '꽃잎길이'])
df1

          품종  꽃잎길이
0     setosa   1.4
1     setosa   1.3
2  virginica   1.5
3  virginica   1.3

In [10]:
df2 = pd.DataFrame({'품종' :['setosa','virginica','virginica','vericolor'],
                    '꽃잎너비':[0.4,0.3,0.5,0.3]},
                   columns=['품종','꽃잎너비'])
df2

          품종  꽃잎너비
0     setosa   0.4
1  virginica   0.3
2  virginica   0.5
3  vericolor   0.3

In [11]:
pd.merge(df1,df2)

          품종  꽃잎길이  꽃잎너비
0     setosa   1.4   0.4
1     setosa   1.3   0.4
2  virginica   1.5   0.3
3  virginica   1.5   0.5
4  virginica   1.3   0.3
5  virginica   1.3   0.5

In [12]:
df1 = pd.DataFrame({'고객명' :['춘향','춘향','몽룡'],
                    '날짜' :['2018-01-01','2017-01-02','2018-01-01'],
                    '데이터':['20000','30000','1000000']})
df1

  고객명          날짜      데이터
0  춘향  2018-01-01    20000
1  춘향  2017-01-02    30000
2  몽룡  2018-01-01  1000000

In [13]:
df2 = pd.DataFrame({'고객명':['춘향','몽룡'],
                    '데이터':['여자','남자']})
df2

  고객명 데이터
0  춘향  여자
1  몽룡  남자

In [14]:
pd.merge(df1,df2,on='고객명')

  고객명          날짜    데이터_x 데이터_y
0  춘향  2018-01-01    20000    여자
1  춘향  2017-01-02    30000    여자
2  몽룡  2018-01-01  1000000    남자

In [15]:
df1 = pd.DataFrame({'이름' :['영희','철수','철수'],
                    '성적' :[1,2,3]})
df1

   이름  성적
0  영희   1
1  철수   2
2  철수   3

In [16]:
df2 = pd.DataFrame({'성명' : ['영희','영희','철수'],
                    '성적2' :[4,5,6]})
df2

   성명  성적2
0  영희    4
1  영희    5
2  철수    6

In [17]:
pd.merge(df1,df2,left_on='이름', right_on='성명')

   이름  성적  성명  성적2
0  영희   1  영희    4
1  영희   1  영희    5
2  철수   2  철수    6
3  철수   3  철수    6

In [18]:
df1 = pd.DataFrame({'도시' :['서울','서울','서울','부산','부산'],
                    '연도' : [2000,2005,2010,2000,2005],
                    '인구' : [9853972, 9762546, 9631482, 3655437, 3512547]})
df1

   도시    연도       인구
0  서울  2000  9853972
1  서울  2005  9762546
2  서울  2010  9631482
3  부산  2000  3655437
4  부산  2005  3512547

In [20]:
df2 = pd.DataFrame(np.arange(12).reshape((6,2)),
                   index =[['부산','부산','서울','서울','서울','서울'],
                           [2000,2005,2000,2005,2010,2015]],
                   columns=['데이터1','데이터2'])
df2

         데이터1  데이터2
부산 2000     0     1
   2005     2     3
서울 2000     4     5
   2005     6     7
   2010     8     9
   2015    10    11

In [21]:
pd.merge(df1,df2,left_on=['도시','연도'],right_index=True)

   도시    연도       인구  데이터1  데이터2
0  서울  2000  9853972     4     5
1  서울  2005  9762546     6     7
2  서울  2010  9631482     8     9
3  부산  2000  3655437     0     1
4  부산  2005  3512547     2     3

In [22]:
df1 = pd.DataFrame([[1,2],[3,4],[5,6]],
                   index = ['a','c','e'],
                   columns=['서울','부산'])
df1

   서울  부산
a   1   2
c   3   4
e   5   6

In [24]:
df2 = pd.DataFrame([[7,8],[9,10],[11,12],[13,14]],
                   index = ['b','c','d','e'],
                   columns=['대구','광주'])
df2

   대구  광주
b   7   8
c   9  10
d  11  12
e  13  14

In [25]:
df1.join(df2,how='outer')

    서울   부산    대구    광주
a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

- concat : 단순히 데이터를 연결(concatenate)

In [26]:
s1 = pd.Series([0,1],index=['A','B'])
s2 = pd.Series([2,3,4],index=['A','B','C'])

In [27]:
pd.concat([s1,s2])

A    0
B    1
A    2
B    3
C    4
dtype: int64

In [28]:
df2 = pd.DataFrame(np.arange(6).reshape(3,2),
                   index=['a','b','c'],
                   columns=['데이터1','데이터2'])
df1

   서울  부산
a   1   2
c   3   4
e   5   6

In [29]:
df2 = pd.DataFrame(5+np.arange(4).reshape(2,2),
                   index =['a','c'],
                   columns=['데이터3','데이터4'])
df2

   데이터3  데이터4
a     5     6
c     7     8

In [30]:
pd.concat([df1,df2],axis = 1) #열방향 합치기

   서울  부산  데이터3  데이터4
a   1   2   5.0   6.0
c   3   4   7.0   8.0
e   5   6   NaN   NaN

## 피폿테이블과 그룹 분석
- 피폿데이블(pivot table): 데이터 열 중에서 두 개를 키(key)로 사용하여 데이터를 선택

In [18]:
data = {
    '도시' :['서울','서울','서울','부산','부산','부산','인천','인천'],
    '연도' :['2015','2010','2005','2015','2010','2005','2015','2010'],
    '인구' :[9904312,9631482,9762546,3448737,3393191,3512547,2890451,2632035],
    '지역' :['수도권','수도권','수도권','경상권','경상권','경상권','수도권','수도권']}
columns= ['도시','연도','인구','지역']
df1 = pd.DataFrame(data, columns=columns)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010  2632035  수도권

In [25]:
df1.pivot('도시', '연도', '인구')

C:\Users\skyme\AppData\Local\Temp\ipykernel_2684\1282232882.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.pivot will be keyword-only.
  df1.pivot('도시', '연도', '인구')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN  2632035.0  2890451.0

In [27]:
df1.set_index(['도시', '연도'])[['인구']]

              인구
도시 연도
서울 2015  9904312
   2010  9631482
   2005  9762546
부산 2015  3448737
   2010  3393191
   2005  3512547
인천 2015  2890451
   2010  2632035

In [28]:
df1.set_index(['도시', '연도'])[['인구']].unstack()

           인구
연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN  2632035.0  2890451.0

## 그룹 분석
- groupby : 데이터를 그룹별로 분류하는 역할
- 그룹 연산 메서드
- size(),count() : 갯수
- mean(),median(),min(),max() : 평균, 중앙값, 최소, 최대
- sum(),prod(),std(),var(),quantile() : 합계, 곱, 표준편차, 분산, 사분위수
- first(),last(): 가장 첫번째 데이터와 가장 나중 데이터
- agg(),aggregate(),describe(),apply(),transform()

In [29]:
np.random.seed(0)
df2 = pd.DataFrame({
    'key1':['A','A','B','B','A'],
    'key2':['one','two','one','two','one'],
    'data1' :[1,2,3,4,5],
    'data2' :[10,20,30,40,50]})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [45]:
df2.groupby(df2.key1).sum()

C:\Users\skyme\AppData\Local\Temp\ipykernel_2684\3825996083.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df2.groupby(df2.key1).sum()

      data1  data2
key1
A         8     80
B         7     70

In [46]:
df2.data2.groupby(df2.key1).sum()

key1
A    80
B    70
Name: data2, dtype: int64

In [47]:
df2.groupby(df2.key1)['data1'].sum()

key1
A    8
B    7
Name: data1, dtype: int64

In [42]:
df2.groupby(df2.key1).sum()['data1']

C:\Users\skyme\AppData\Local\Temp\ipykernel_2684\37063340.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df2.groupby(df2.key1).sum()['data1']

key1
A    8
B    7
Name: data1, dtype: int64

In [52]:
df2.data1.groupby([df2.key1, df2.key2]).sum()

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64

In [53]:
df2.data1.groupby([df2['key1'],df2['key2']]).sum().unstack('key2')

key2  one  two
key1
A       6    2
B       3    4

In [54]:
df1['인구'].groupby([df1['지역'],df1["연도"]]).sum().unstack("연도")

연도      2005      2010      2015
지역
경상권  3512547   3393191   3448737
수도권  9762546  12263517  12794763

In [56]:
!pip install seaborn

Collecting seaborn
  Using cached seaborn-0.12.1-py3-none-any.whl (288 kB)
Requirement already satisfied: matplotlib!=3.6.1,>=3.1 in c:\users\skyme\appdata\roaming\jupyterlab-desktop\jlab_server\lib\site-packages (from seaborn) (3.6.2)
Requirement already satisfied: pandas>=0.25 in c:\users\skyme\appdata\roaming\jupyterlab-desktop\jlab_server\lib\site-packages (from seaborn) (1.5.2)
Requirement already satisfied: numpy>=1.17 in c:\users\skyme\appdata\roaming\jupyterlab-desktop\jlab_server\lib\site-packages (from seaborn) (1.23.5)
Requirement already satisfied: pyparsing>=2.2.1 in c:\users\skyme\appdata\roaming\jupyterlab-desktop\jlab_server\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (3.0.9)
Requirement already satisfied: cycler>=0.10 in c:\users\skyme\appdata\roaming\jupyterlab-desktop\jlab_server\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (0.11.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\skyme\appdata\roaming\jupyterlab-desktop\jlab_server\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (1.4.4)
Requirement already satisfied: pillow>=6.2.0 in c:\users\skyme\appdata\roaming\jupyterlab-desktop\jlab_server\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (9.2.0)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\skyme\appdata\roaming\jupyterlab-desktop\jlab_server\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (2.8.2)
Requirement already satisfied: packaging>=20.0 in c:\users\skyme\appdata\roaming\jupyterlab-desktop\jlab_server\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (22.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\skyme\appdata\roaming\jupyterlab-desktop\jlab_server\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (4.38.0)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\skyme\appdata\roaming\jupyterlab-desktop\jlab_server\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (1.0.6)
Requirement already satisfied: pytz>=2020.1 in c:\users\skyme\appdata\roaming\jupyterlab-desktop\jlab_server\lib\site-packages (from pandas>=0.25->seaborn) (2022.6)
Requirement already satisfied: six>=1.5 in c:\users\skyme\appdata\roaming\jupyterlab-desktop\jlab_server\lib\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.1->seaborn) (1.16.0)
Installing collected packages: seaborn
Successfully installed seaborn-0.12.1

In [57]:
import seaborn as sns
iris = sns.load_dataset('iris')

In [60]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [58]:
def peak_to_peak_ratio(x):
    return x.max()/x.min()

In [59]:
iris.groupby(iris.species).agg(peak_to_peak_ratio)

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

In [62]:
iris.groupby(iris.species).describe().T

species                setosa  versicolor  virginica
sepal_length count  50.000000   50.000000  50.000000
             mean    5.006000    5.936000   6.588000
             std     0.352490    0.516171   0.635880
             min     4.300000    4.900000   4.900000
             25%     4.800000    5.600000   6.225000
             50%     5.000000    5.900000   6.500000
             75%     5.200000    6.300000   6.900000
             max     5.800000    7.000000   7.900000
sepal_width  count  50.000000   50.000000  50.000000
             mean    3.428000    2.770000   2.974000
             std     0.379064    0.313798   0.322497
             min     2.300000    2.000000   2.200000
             25%     3.200000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.675000    3.000000   3.175000
             max     4.400000    3.400000   3.800000
petal_length count  50.000000   50.000000  50.000000
             mean    1.462000    4.260000   5.552000
             std     0.173664    0.469911   0.551895
             min     1.000000    3.000000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.350000   5.550000
             75%     1.575000    4.600000   5.875000
             max     1.900000    5.100000   6.900000
petal_width  count  50.000000   50.000000  50.000000
             mean    0.246000    1.326000   2.026000
             std     0.105386    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.600000    1.800000   2.500000

In [67]:
def max3(df):
    return df.sort_values(by='petal_length')[:3]

In [69]:
max3(iris)

    sepal_length  sepal_width  petal_length  petal_width species
22           4.6          3.6           1.0          0.2  setosa
13           4.3          3.0           1.1          0.1  setosa
14           5.8          4.0           1.2          0.2  setosa

In [68]:
iris.groupby(iris.species).apply(max3)

                sepal_length  sepal_width  petal_length  petal_width  \
species
setosa     22            4.6          3.6           1.0          0.2
           13            4.3          3.0           1.1          0.1
           14            5.8          4.0           1.2          0.2
versicolor 98            5.1          2.5           3.0          1.1
           93            5.0          2.3           3.3          1.0
           57            4.9          2.4           3.3          1.0
virginica  106           4.9          2.5           4.5          1.7
           126           6.2          2.8           4.8          1.8
           138           6.0          3.0           4.8          1.8

                   species
species
setosa     22       setosa
           13       setosa
           14       setosa
versicolor 98   versicolor
           93   versicolor
           57   versicolor
virginica  106   virginica
           126   virginica
           138   virginica

In [72]:
def q3cut(s):
    return pd.qcut(s,3,labels=['소','중','대'])

In [73]:
iris['petal_length_class'] = iris.groupby(
    iris.species)['petal_length'].transform(q3cut)
iris[['petal_length','petal_length_class']].tail(10)

     petal_length petal_length_class
140           5.6                  중
141           5.1                  소
142           5.1                  소
143           5.9                  대
144           5.7                  중
145           5.2                  소
146           5.0                  소
147           5.2                  소
148           5.4                  중
149           5.1                  소

## flight 데이터 결측치 처리 연습문제

In [1]:
import pandas as pd
import numpy as np

### 1. flights.csv 읽기

In [2]:
flights = pd.read_csv("flights.csv")
flights

,MONTH,DAY,WEEKDAY,AIRLINE,ORG_AIR,DEST_AIR,SCHED_DEP,DEP_DELAY,AIR_TIME,DIST,SCHED_ARR,ARR_DELAY,DIVERTED,CANCELLED
0,1,1,4,WN,LAX,SLC,1625,58.0,94.0,590,1905,65.0,0,0
1,1,1,4,UA,DEN,IAD,823,7.0,154.0,1452,1333,-13.0,0,0
2,1,1,4,MQ,DFW,VPS,1305,36.0,85.0,641,1453,35.0,0,0
3,1,1,4,AA,DFW,DCA,1555,7.0,126.0,1192,1935,-7.0,0,0
4,1,1,4,WN,LAX,MCI,1720,48.0,166.0,1363,2225,39.0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
58487,12,31,4,AA,SFO,DFW,515,5.0,166.0,1464,1045,-19.0,0,0
58488,12,31,4,F9,LAS,SFO,1910,13.0,71.0,414,2050,4.0,0,0
58489,12,31,4,OO,SFO,SBA,1846,-6.0,46.0,262,1956,-5.0,0,0
58490,12,31,4,WN,MSP,ATL,525,39.0,124.0,907,855,34.0,0,0
58491,12,31,4,OO,SFO,BOI,859,5.0,73.0,522,1146,-1.0,0,0

### 2.결측치 파악
- DEP_DELAY : 833개
- AIR_TIME : 1018개
- ARR_DELAY : 1018개
- AIR_TIME과 ARR_DELAY는 같은 행임

In [3]:
flights.count()

MONTH        58492
DAY          58492
WEEKDAY      58492
AIRLINE      58492
ORG_AIR      58492
DEST_AIR     58492
SCHED_DEP    58492
DEP_DELAY    57659
AIR_TIME     57474
DIST         58492
SCHED_ARR    58492
ARR_DELAY    57474
DIVERTED     58492
CANCELLED    58492
dtype: int64

In [4]:
flights.isnull().sum()

MONTH           0
DAY             0
WEEKDAY         0
AIRLINE         0
ORG_AIR         0
DEST_AIR        0
SCHED_DEP       0
DEP_DELAY     833
AIR_TIME     1018
DIST            0
SCHED_ARR       0
ARR_DELAY    1018
DIVERTED        0
CANCELLED       0
dtype: int64

In [5]:
missing_data_DD = flights[flights.DEP_DELAY.isna()]
print(missing_data_DD)

       MONTH  DAY  WEEKDAY AIRLINE ORG_AIR DEST_AIR  SCHED_DEP  DEP_DELAY  \
24         1    1        4      MQ     DFW      BTR        730        NaN
51         1    1        4      OO     PHX      SLC        950        NaN
73         1    1        4      AA     DFW      ICT       1000        NaN
78         1    1        4      MQ     DFW      SJT       2155        NaN
106        1    1        4      EV     DFW      LAW       1130        NaN
...      ...  ...      ...     ...     ...      ...        ...        ...
58212     12   30        3      MQ     ORD      GRR       1314        NaN
58215     12   30        3      UA     LAS      EWR       2300        NaN
58218     12   30        3      UA     SFO      MCO        845        NaN
58274     12   30        3      MQ     ORD      GRR        845        NaN
58339     12   30        3      UA     IAH      SAN       1453        NaN

       AIR_TIME  DIST  SCHED_ARR  ARR_DELAY  DIVERTED  CANCELLED
24          NaN   383        853        NaN         0          1
51          NaN   507       1138        NaN         0          1
73          NaN   328       1115        NaN         0          1
78          NaN   229       2253        NaN         0          1
106         NaN   140       1215        NaN         0          1
...         ...   ...        ...        ...       ...        ...
58212       NaN   137       1506        NaN         0          1
58215       NaN  2227        641        NaN         0          1
58218       NaN  2446       1656        NaN         0          1
58274       NaN   137       1044        NaN         0          1
58339       NaN  1303       1629        NaN         0          1

[833 rows x 14 columns]

In [6]:
missing_data_AT = flights[flights.AIR_TIME.isna()]
print(missing_data_AT)

       MONTH  DAY  WEEKDAY AIRLINE ORG_AIR DEST_AIR  SCHED_DEP  DEP_DELAY  \
24         1    1        4      MQ     DFW      BTR        730        NaN
51         1    1        4      OO     PHX      SLC        950        NaN
73         1    1        4      AA     DFW      ICT       1000        NaN
78         1    1        4      MQ     DFW      SJT       2155        NaN
106        1    1        4      EV     DFW      LAW       1130        NaN
...      ...  ...      ...     ...     ...      ...        ...        ...
58212     12   30        3      MQ     ORD      GRR       1314        NaN
58215     12   30        3      UA     LAS      EWR       2300        NaN
58218     12   30        3      UA     SFO      MCO        845        NaN
58274     12   30        3      MQ     ORD      GRR        845        NaN
58339     12   30        3      UA     IAH      SAN       1453        NaN

       AIR_TIME  DIST  SCHED_ARR  ARR_DELAY  DIVERTED  CANCELLED
24          NaN   383        853        NaN         0          1
51          NaN   507       1138        NaN         0          1
73          NaN   328       1115        NaN         0          1
78          NaN   229       2253        NaN         0          1
106         NaN   140       1215        NaN         0          1
...         ...   ...        ...        ...       ...        ...
58212       NaN   137       1506        NaN         0          1
58215       NaN  2227        641        NaN         0          1
58218       NaN  2446       1656        NaN         0          1
58274       NaN   137       1044        NaN         0          1
58339       NaN  1303       1629        NaN         0          1

[1018 rows x 14 columns]

In [7]:
missing_data_AD = flights[flights.ARR_DELAY.isna()]
print(missing_data_AD)

       MONTH  DAY  WEEKDAY AIRLINE ORG_AIR DEST_AIR  SCHED_DEP  DEP_DELAY  \
24         1    1        4      MQ     DFW      BTR        730        NaN
51         1    1        4      OO     PHX      SLC        950        NaN
73         1    1        4      AA     DFW      ICT       1000        NaN
78         1    1        4      MQ     DFW      SJT       2155        NaN
106        1    1        4      EV     DFW      LAW       1130        NaN
...      ...  ...      ...     ...     ...      ...        ...        ...
58212     12   30        3      MQ     ORD      GRR       1314        NaN
58215     12   30        3      UA     LAS      EWR       2300        NaN
58218     12   30        3      UA     SFO      MCO        845        NaN
58274     12   30        3      MQ     ORD      GRR        845        NaN
58339     12   30        3      UA     IAH      SAN       1453        NaN

       AIR_TIME  DIST  SCHED_ARR  ARR_DELAY  DIVERTED  CANCELLED
24          NaN   383        853        NaN         0          1
51          NaN   507       1138        NaN         0          1
73          NaN   328       1115        NaN         0          1
78          NaN   229       2253        NaN         0          1
106         NaN   140       1215        NaN         0          1
...         ...   ...        ...        ...       ...        ...
58212       NaN   137       1506        NaN         0          1
58215       NaN  2227        641        NaN         0          1
58218       NaN  2446       1656        NaN         0          1
58274       NaN   137       1044        NaN         0          1
58339       NaN  1303       1629        NaN         0          1

[1018 rows x 14 columns]

In [8]:
q = missing_data_AT.index == missing_data_AD.index
q[q==False]

array([], dtype=bool)

### 3. 결측치 대체
#### 대체값 : 열값의 평균

In [9]:
flights.DEP_DELAY.mean()

10.921191834752598

In [10]:
flights.DEP_DELAY.fillna(flights.DEP_DELAY.mean(),inplace = True)

In [11]:
flights.AIR_TIME.mean()

115.92857639976337

In [12]:
flights.AIR_TIME.fillna(flights.AIR_TIME.mean(),inplace = True)

In [13]:
flights.ARR_DELAY.mean()

5.812315133799631

In [14]:
flights.ARR_DELAY.fillna(flights.ARR_DELAY.mean(),inplace = True)

In [15]:
flights.count()

MONTH        58492
DAY          58492
WEEKDAY      58492
AIRLINE      58492
ORG_AIR      58492
DEST_AIR     58492
SCHED_DEP    58492
DEP_DELAY    58492
AIR_TIME     58492
DIST         58492
SCHED_ARR    58492
ARR_DELAY    58492
DIVERTED     58492
CANCELLED    58492
dtype: int64

In [16]:
flights.isnull().sum()

MONTH        0
DAY          0
WEEKDAY      0
AIRLINE      0
ORG_AIR      0
DEST_AIR     0
SCHED_DEP    0
DEP_DELAY    0
AIR_TIME     0
DIST         0
SCHED_ARR    0
ARR_DELAY    0
DIVERTED     0
CANCELLED    0
dtype: int64

### 4. 항공사별 dep_delay 값들의 평균 구하기

In [17]:
group_dep_delay = flights.groupby("AIRLINE")['DEP_DELAY'].mean()
group_dep_delay

AIRLINE
AA    11.268110
AS     1.808594
B6    14.281623
DL     7.255637
EV     9.135077
F9    14.287237
HA     2.571429
MQ    11.087240
NK    19.384029
OO     9.687121
UA    16.152108
US     4.446653
VX     8.931044
WN    12.620792
Name: DEP_DELAY, dtype: float64

### 5. Pivot Table 이용하여, airline, org_air 별로 Sched_dep 값 출력

In [18]:
PT = pd.pivot_table(flights, index= ['AIRLINE','ORG_AIR'], values = 'SCHED_DEP')
PT

                   SCHED_DEP
AIRLINE ORG_AIR
AA      ATL      1248.725322
        DEN      1186.324201
        DFW      1415.676485
        IAH      1244.454082
        LAS      1151.417112
...                      ...
WN      LAS      1363.037912
        LAX      1332.555066
        MSP      1242.953586
        PHX      1349.495360
        SFO      1311.191011

[114 rows x 1 columns]

### 6. 4번, 5번 결과를 flights_new.xlsx에 각 sheet로 저장

In [19]:
#!pip install openpyxl

In [20]:
writer = pd.ExcelWriter('flights_new.xlsx',engine='openpyxl')
group_dep_delay.to_excel(writer,sheet_name='sheet1')
PT.to_excel(writer,sheet_name='sheet2')
writer.save()

C:\Users\skyme\AppData\Local\Temp\ipykernel_18556\1980173762.py:4: FutureWarning: save is not part of the public API, usage can give unexpected results and will be removed in a future version
  writer.save()

## 퀴즈 11

In [1]:
import pandas as pd
import numpy as np

#### 1번

In [2]:
df = pd.DataFrame([[0.664520,0.147264],[-0.982510,1.559342],[-0.739997,-0.458691],
                   [0.944259,-0.484302],[2.084118,-0.192427],[0.231897,-2.388968]],
                 index= [['G1','G1','G1','G2','G2','G2'],[1,2,3,1,2,3]],
                 columns = ['A','B'])
df

             A         B
G1 1  0.664520  0.147264
   2 -0.982510  1.559342
   3 -0.739997 -0.458691
G2 1  0.944259 -0.484302
   2  2.084118 -0.192427
   3  0.231897 -2.388968

#### 2번

In [3]:
df.loc['G1'].loc[1]

A    0.664520
B    0.147264
Name: 1, dtype: float64

In [4]:
df.loc[('G1',1)]

A    0.664520
B    0.147264
Name: (G1, 1), dtype: float64

#### 3번

In [5]:
from datetime import datetime
dt_ind = pd.DatetimeIndex([datetime(2022,8,1),datetime(2022,8,2),datetime(2022,8,3),
datetime(2022,8,4),datetime(2022,8,5),datetime(2022,8,6),
datetime(2022,8,7),datetime(2022,8,8),datetime(2022,8,9),
datetime(2022,8,10)])
df = pd.DataFrame(range(10),dt_ind)
df

            0
2022-08-01  0
2022-08-02  1
2022-08-03  2
2022-08-04  3
2022-08-05  4
2022-08-06  5
2022-08-07  6
2022-08-08  7
2022-08-09  8
2022-08-10  9

In [6]:
import pandas as pd
import numpy as np
df = pd.DataFrame(range(10), index = pd.date_range('2022-8-1',periods=10))
df

            0
2022-08-01  0
2022-08-02  1
2022-08-03  2
2022-08-04  3
2022-08-05  4
2022-08-06  5
2022-08-07  6
2022-08-08  7
2022-08-09  8
2022-08-10  9

#### 4번

In [7]:
heart = pd.read_csv("Heart.csv",index_col=0)
heart

,Age,Sex,ChestPain,RestBP,Chol,Fbs,RestECG,MaxHR,ExAng,Oldpeak,Slope,Ca,Thal,AHD
1,63,1,typical,145,233,1,2,150,0,2.3,3,0.0,fixed,No
2,67,1,asymptomatic,160,286,0,2,108,1,1.5,2,3.0,normal,Yes
3,67,1,asymptomatic,120,229,0,2,129,1,2.6,2,2.0,reversable,Yes
4,37,1,nonanginal,130,250,0,0,187,0,3.5,3,0.0,normal,No
5,41,0,nontypical,130,204,0,2,172,0,1.4,1,0.0,normal,No
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
299,45,1,typical,110,264,0,0,132,0,1.2,2,0.0,reversable,Yes
300,68,1,asymptomatic,144,193,1,0,141,0,3.4,2,2.0,reversable,Yes
301,57,1,asymptomatic,130,131,0,0,115,1,1.2,2,1.0,reversable,Yes
302,57,0,nontypical,130,236,0,2,174,0,0.0,2,1.0,normal,Yes
303,38,1,nonanginal,138,175,0,0,173,0,0.0,1,NaN,normal,No

In [8]:
heart.isnull().sum()

Age          0
Sex          0
ChestPain    0
RestBP       0
Chol         0
Fbs          0
RestECG      0
MaxHR        0
ExAng        0
Oldpeak      0
Slope        0
Ca           4
Thal         2
AHD          0
dtype: int64

In [9]:
heart.groupby("ChestPain")['Chol'].mean()

ChestPain
asymptomatic    250.513889
nonanginal      243.965116
nontypical      244.780000
typical         237.130435
Name: Chol, dtype: float64

In [10]:
pd.pivot_table(heart, index = ['AHD','Sex'], values = 'Chol')

               Chol
AHD Sex
No  0    256.750000
    1    231.597826
Yes 0    276.160000
    1    246.061404

#### 6번
- 두 개의 명목형 변수로 분할표를 만들 때 crosstab

In [11]:
heart.groupby(heart.Sex)['AHD'].value_counts()

Sex  AHD
0    No      72
     Yes     25
1    Yes    114
     No      92
Name: AHD, dtype: int64

In [17]:
heart.groupby(heart.Sex).value_counts(['AHD'])

Sex  AHD
0    No      72
     Yes     25
1    Yes    114
     No      92
dtype: int64

In [12]:
pd.crosstab(heart['Sex'],heart['AHD'])

AHD  No  Yes
Sex
0    72   25
1    92  114

#### 7번

In [18]:
data = {
'food': ['KFC', 'McDonald', 'SchoolFood'],
'price': [1000, 2000, 2500],
'rating': [4.5, 3.9, 4.2]
}
df = pd.DataFrame(data)
df

         food  price  rating
0         KFC   1000     4.5
1    McDonald   2000     3.9
2  SchoolFood   2500     4.2

In [19]:
df[['food','rating']]

         food  rating
0         KFC     4.5
1    McDonald     3.9
2  SchoolFood     4.2

#### 8번

In [20]:
df.rename(columns={'food':'place'},inplace =True)
df

        place  price  rating
0         KFC   1000     4.5
1    McDonald   2000     3.9
2  SchoolFood   2500     4.2

#### 9번

In [21]:
left = pd.DataFrame({'key': ['foo', 'bar', 'poo'], 'lval': [1, 2, 3]})
right = pd.DataFrame({'key': ['bar', 'foo', 'woo'], 'rval': [4, 5, 6]})
left

   key  lval
0  foo     1
1  bar     2
2  poo     3

In [22]:
right

   key  rval
0  bar     4
1  foo     5
2  woo     6

In [25]:
pd.merge(left,right,on='key',how='left')

   key  lval  rval
0  foo     1   5.0
1  bar     2   4.0
2  poo     3   NaN

#### 10번

In [26]:
pd.merge(left,right,on='key',how='inner')

   key  lval  rval
0  foo     1     5
1  bar     2     4